IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/C2000/f280015x_sys_status_regs.xml
<module id="SYS_STATUS_REGS" HW_revision="" description="SYS STATUS Registers">
	<register id="SYS_ERR_INT_FLG" width="32" page="1" offset="0x10" internal="0" description="Status of interrupts due to multiple different errors in the system.">
		<bitfield id="GINT" description="Global Interrupt flag" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="CORRECTABLE_ERR" description="RAM/Flash correctable error flag" begin="2" end="2" width="1" rwaccess="R"/>
		<bitfield id="RAM_ACC_VIOL" description="A RAM access vioation flag." begin="4" end="4" width="1" rwaccess="R"/>
		<bitfield id="EPG1_INT" description="EPG1_INT Interrupt flag." begin="11" end="11" width="1" rwaccess="R"/>
		<bitfield id="FPU_UFLOW" description="FPU_UFLOW Interrupt flag." begin="16" end="16" width="1" rwaccess="R"/>
		<bitfield id="FPU_OFLOW" description="FPU_OFLOW Interrupt flag." begin="17" end="17" width="1" rwaccess="R"/>
	</register>
	<register id="SYS_ERR_INT_CLR" width="32" page="1" offset="0x12" internal="0" description="SYS_ERR_INT_FLG clear register">
		<bitfield id="GINT" description="Global Interrupt flag Clear bit" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CORRECTABLE_ERR" description="CORRECTABLE_ERR interrupt flag clear bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="RAM_ACC_VIOL" description="RAM_ACC_VIOL interrupt flag clear bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="EPG1_INT" description="EPG1_INT interrupt flag clear bit" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="FPU_UFLOW" description="FPU_UFLOW interrupt flag clear bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="FPU_OFLOW" description="FPU_OFLOW interrupt flag clear bit" begin="17" end="17" width="1" rwaccess="RW"/>
	</register>
	<register id="SYS_ERR_INT_SET" width="32" page="1" offset="0x14" internal="0" description="SYS_ERR_INT_FLG set register">
		<bitfield id="CORRECTABLE_ERR" description="CORRECTABLE_ERR interrupt flag set bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="RAM_ACC_VIOL" description="RAM_ACC_VIOL interrupt flag set bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="EPG1_INT" description="EPG1_INT interrupt flag set bit" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="FPU_UFLOW" description="FPU_UFLOW interrupt flag set bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="FPU_OFLOW" description="FPU_OFLOW interrupt flag set bit" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="KEY field" begin="31" end="24" width="8" rwaccess="RW"/>
	</register>
	<register id="SYS_ERR_MASK" width="32" page="1" offset="0x16" internal="0" description="SYS_ERR_MASK register">
		<bitfield id="CORRECTABLE_ERR" description="CORRECTABLE_ERR flag mask bit" begin="2" end="2" width="1" rwaccess="RW"/>
		<bitfield id="RAM_ACC_VIOL" description="RAM_ACC_VIOL flag mask bit" begin="4" end="4" width="1" rwaccess="RW"/>
		<bitfield id="EPG1_INT" description="EPG1_INT flag mask bit" begin="11" end="11" width="1" rwaccess="RW"/>
		<bitfield id="FPU_UFLOW" description="FPU_UFLOW flag mask bit" begin="16" end="16" width="1" rwaccess="RW"/>
		<bitfield id="FPU_OFLOW" description="FPU_OFLOW flag mask bit" begin="17" end="17" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="KEY field" begin="31" end="24" width="8" rwaccess="RW"/>
	</register>
	<register id="LCM_ERR_FLG" width="32" page="1" offset="0x18" internal="0" description="Status register indicating lockstep compare error flag">
		<bitfield id="GERR" description="Global Error event flag" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="CPU" description="CPU1 Lockstep Miscompare flag" begin="1" end="1" width="1" rwaccess="R"/>
	</register>
	<register id="LCM_ERR_FLG_CLR" width="32" page="1" offset="0x1a" internal="0" description="LCM_ERR_FLG clear register">
		<bitfield id="GERR" description="Global Error event flag clear" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CPU" description="CPU1 Lockstep Miscompare flag clear" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="LCM_ERR_FLG_SET" width="32" page="1" offset="0x1c" internal="0" description="LCM_ERR_FLG set register">
		<bitfield id="CPU" description="CPU1 Lockstep Miscompare flag clear set" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="KEY field" begin="31" end="24" width="8" rwaccess="RW"/>
	</register>
	<register id="REGPARITY_ERR_FLG" width="32" page="1" offset="0x20" internal="0" description="Status register indicating register parity error flag">
		<bitfield id="GERR" description="Global Error event flag" begin="0" end="0" width="1" rwaccess="R"/>
		<bitfield id="CPU" description="Register parity error from lockstep compare module" begin="1" end="1" width="1" rwaccess="R"/>
	</register>
	<register id="REGPARITY_ERR_FLG_CLR" width="32" page="1" offset="0x22" internal="0" description="REGPARITY_ERR_FLG clear register">
		<bitfield id="GERR" description="Global Error event flag clear" begin="0" end="0" width="1" rwaccess="RW"/>
		<bitfield id="CPU" description="Register parity error from lockstep compare module clear" begin="1" end="1" width="1" rwaccess="RW"/>
	</register>
	<register id="REGPARITY_ERR_FLG_SET" width="32" page="1" offset="0x24" internal="0" description="REGPARITY_ERR_FLG set register">
		<bitfield id="CPU" description="Register parity error from lockstep compare module set" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="KEY field" begin="31" end="24" width="8" rwaccess="RW"/>
	</register>
	<register id="REGPARITY_ERR_FLG_MASK" width="32" page="1" offset="0x26" internal="0" description="REGPARITY_ERR_FLG mask register">
		<bitfield id="CPU" description="Register parity error from lockstep compare module mask" begin="1" end="1" width="1" rwaccess="RW"/>
		<bitfield id="KEY" description="KEY field" begin="31" end="24" width="8" rwaccess="RW"/>
	</register>
</module>
